zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/MCXN946T/MCXN946T_cm33_core1_features.h
/* SAI module features */

/* @brief Receive/transmit FIFO size in item count (register bit fields TCSR[FRDE], TCSR[FRIE], TCSR[FRF], TCR1[TFW], RCSR[FRDE], RCSR[FRIE], RCSR[FRF], RCR1[RFW], registers TFRn, RFRn). */
#define FSL_FEATURE_SAI_FIFO_COUNTn(x) (8)
/* @brief Receive/transmit channel number (register bit fields TCR3[TCE], RCR3[RCE], registers TDRn and RDRn). */
#define FSL_FEATURE_SAI_CHANNEL_COUNTn(x) (2)
/* @brief Maximum words per frame (register bit fields TCR3[WDFL], TCR4[FRSZ], TMR[TWM], RCR3[WDFL], RCR4[FRSZ], RMR[RWM]). */
#define FSL_FEATURE_SAI_MAX_WORDS_PER_FRAME (32)
/* @brief Has support of combining multiple data channel FIFOs into single channel FIFO (register bit fields TCR3[CFR], TCR4[FCOMB], TFR0[WCP], TFR1[WCP], RCR3[CFR], RCR4[FCOMB], RFR0[RCP], RFR1[RCP]). */
#define FSL_FEATURE_SAI_HAS_FIFO_COMBINE_MODE (1)
/* @brief Has packing of 8-bit and 16-bit data into each 32-bit FIFO word (register bit fields TCR4[FPACK], RCR4[FPACK]). */
#define FSL_FEATURE_SAI_HAS_FIFO_PACKING (1)
/* @brief Configures when the SAI will continue transmitting after a FIFO error has been detected (register bit fields TCR4[FCONT], RCR4[FCONT]). */
#define FSL_FEATURE_SAI_HAS_FIFO_FUNCTION_AFTER_ERROR (1)
/* @brief Configures if the frame sync is generated internally, a frame sync is only generated when the FIFO warning flag is clear or continuously (register bit fields TCR4[ONDEM], RCR4[ONDEM]). */
#define FSL_FEATURE_SAI_HAS_ON_DEMAND_MODE (1)
/* @brief Simplified bit clock source and asynchronous/synchronous mode selection (register bit fields TCR2[CLKMODE], RCR2[CLKMODE]), in comparison with the exclusively implemented TCR2[SYNC,BCS,BCI,MSEL], RCR2[SYNC,BCS,BCI,MSEL]. */
#define FSL_FEATURE_SAI_HAS_CLOCKING_MODE (0)
/* @brief Has register for configuration of the MCLK divide ratio (register bit fields MDR[FRACT], MDR[DIVIDE]). */
#define FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER (0)
/* @brief Interrupt source number */
#define FSL_FEATURE_SAI_INT_SOURCE_NUM (1)
/* @brief Has register of MCR. */
#define FSL_FEATURE_SAI_HAS_MCR (1)
/* @brief Has bit field MICS of the MCR register. */
#define FSL_FEATURE_SAI_HAS_NO_MCR_MICS (1)
/* @brief Has register of MDR */
#define FSL_FEATURE_SAI_HAS_MDR (0)
/* @brief Has support the BCLK bypass mode when BCLK = MCLK. */
#define FSL_FEATURE_SAI_HAS_BCLK_BYPASS (1)
/* @brief Has DIV bit fields of MCR register (register bit fields MCR[DIV]). */
#define FSL_FEATURE_SAI_HAS_MCR_MCLK_POST_DIV (1)
/* @brief Support Channel Mode (register bit fields TCR4[CHMOD]). */
#define FSL_FEATURE_SAI_HAS_CHANNEL_MODE (1)
/* @brief SAI has FIFO in this soc (register bit fields TCR1[TFW]. */
#define FSL_FEATURE_SAI_HAS_FIFO (1)
/* @brief Support synchronous with another SAI. */
#define FSL_FEATURE_SAI_HAS_SYNC_WITH_ANOTHER_SAI (1)
/* @brief Has Bit Clock Swap option (register bit fields RCR2[BCS]) */
#define FSL_FEATURE_SAI_HAS_BIT_CLOCK_SWAP (1)
/* @brief SAI5 and SAI6 share one irq number. */
#define FSL_FEATURE_SAI_SAI5_SAI6_SHARE_IRQ (0)

/* SCT module features */

/* @brief Number of events */
#define FSL_FEATURE_SCT_NUMBER_OF_EVENTS (16)
/* @brief Number of states */
#define FSL_FEATURE_SCT_NUMBER_OF_STATES (16)
/* @brief Number of match capture */
#define FSL_FEATURE_SCT_NUMBER_OF_MATCH_CAPTURE (16)
/* @brief Number of outputs */
#define FSL_FEATURE_SCT_NUMBER_OF_OUTPUTS (10)
/* @brief Writing a zero asserts the SCT reset. */
#define FSL_FEATURE_SCT_WRITE_ZERO_ASSERT_RESET (0)

/* SEMA42 module features */

/* @brief Gate counts */
#define FSL_FEATURE_SEMA42_GATE_COUNT (16)

/* SINC module features */

/* @brief SINC channel count. */
#define FSL_FEATURE_SINC_CHANNEL_COUNT (5)
/* @brief SINC CACFR register has bitfield ADMASEL. */
#define FSL_FEATURE_SINC_CACFR_HAS_ADMASEL (1)
/* @brief SINC CACFR register has no bitfield PTMUX. */
#define FSL_FEATURE_SINC_CACFR_HAS_NO_PTMUX (1)

/* SPC module features */

/* @brief Has DCDC. */
#define FSL_FEATURE_MCX_SPC_HAS_DCDC (1)
/* @brief Has SYS LDO. */
#define FSL_FEATURE_MCX_SPC_HAS_SYS_LDO (1)
/* @brief Has IOVDD_LVDF. */
#define FSL_FEATURE_MCX_SPC_HAS_IOVDD_VD (1)
/* @brief Has COREVDD_HVDF. */
#define FSL_FEATURE_MCX_SPC_HAS_COREVDD_HVD (1)
/* @brief Has CORELDO_VDD_DS. */
#define FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS (1)
/* @brief Has LPBUFF_EN. */
#define FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT (1)
/* @brief Has COREVDD_IVS_EN. */
#define FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT (1)
/* @brief Has SWITCH_STATE. */
#define FSL_FEATURE_MCX_SPC_HAS_SWITCH_STATE_BIT (0)
/* @brief Has SRAMRETLDO. */
#define FSL_FEATURE_MCX_SPC_HAS_SRAMRETLDO_REG (0)
/* @brief Has CFG register. */
#define FSL_FEATURE_MCX_SPC_HAS_CFG_REG (0)
/* @brief Has SRAMLDO_DPD_ON. */
#define FSL_FEATURE_MCX_SPC_HAS_SRAMLDO_DPD_ON_BIT (0)
/* @brief Has CNTRL register. */
#define FSL_FEATURE_MCX_SPC_HAS_CNTRL_REG (1)
/* @brief Has DPDOWN_PULLDOWN_DISABLE. */
#define FSL_FEATURE_MCX_SPC_HAS_DPDOWN_PULLDOWN_DISABLE_BIT (1)
/* @brief Not have glitch detect. */
#define FSL_FEATURE_MCX_SPC_HAS_NO_GLITCH_DETECT (0)
/* @brief Has BLEED_EN. */
#define FSL_FEATURE_MCX_SPC_HAS_DCDC_CFG_BLEED_EN (1)
/* @brief Has Power Request Status Flag. */
#define FSL_FEATURE_MCX_SPC_HAS_PD_STATUS_PWR_REQ_STATUS_BIT (1)
/* @brief Support overdrive voltage. */
#define FSL_FEATURE_MCX_SPC_SUPPORT_OVERDRIVE_VOLTAGE (1)
/* @brief Has SPC_LP_REQ bit in SC register. */
#define FSL_FEATURE_MCX_SPC_HAS_SC_SPC_LP_REQ_BIT (1)
/* @brief Has SPC_LP_MODE bit in SC register. */
#define FSL_FEATURE_MCX_SPC_HAS_SC_SPC_LP_MODE_BIT (1)
/* @brief Has SRAMCTL register. */
#define FSL_FEATURE_MCX_SPC_HAS_SRAMCTL_REG (1)
/* @brief Has PD_STATUS register. */
#define FSL_FEATURE_MCX_SPC_HAS_PD_STATUS_REG (1)
/* @brief Has SRAMRETLDO_REFTRIM register. */
#define FSL_FEATURE_MCX_SPC_HAS_SRAMRETLDO_REFTRIM_REG (0)
/* @brief Has LVSEL bitfield in VD_IO_CFG register. */
#define FSL_FEATURE_MCX_SPC_HAS_VD_IO_CFG_LVSEL (1)
/* @brief Has high-voltage detect on IO VDD. */
#define FSL_FEATURE_MCX_SPC_HAS_IOVDD_HVD (1)

